applications/test/reactingDBS/calciteCrystalWithlooseResidualControl/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState Boussinesq;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight       18;
        // molWeight   28.9;
    }
    equationOfState
    {
        rho0            1000;
        T0              300;
        beta            3e-03;
    }
    thermodynamics
    {
        Cv              4200;
        Hf              0;
    }
    transport
    {
        mu              1e-03;
        Pr              0.001;
    }
}


// ************************************************************************* //
