applications/test/reactingDBS/calciteCrystalWithlooseResidualControl/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    "epsSolid.*"
    {
        solver          diagonal;
    }


    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-6;
        relTol          0.1;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|e|Y)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|e|Y)Final"
    {
        $U;
        relTol          0;
    }

}

// PIMPLE
// {
//     nNonOrthogonalCorrectors 0;
//     nCorrectors         2;
// }

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
        
}



// ************************************************************************* //
